// "Расставить на стандартной 64-клеточной шахматной доске 8 ферзей так, чтобы ни один из них не 
// находился под боем другого".

// Задачу можно обобщить следующим образом: "На шахматной доске со стороной N, 
// расставить N ферзей так, чтобы ни один из них не находился под боем другого".

// isSafeQueens.js
// Реализуйте и экспортируйте по умолчанию isSafeQueens, которая принимает комбинацию ферзей 
// в виде списка и проверяет, является ли данная расстановка решением задачи.

// Комбинации передаются следующим образом:

// (2, 4, 1, 3)

// где числа - это позиция ферзя по вертикали, а порядок числа в списке - 
// позиция ферзя по горизонтали.

const isSafeQueens = (...items) => {
  // your code here
}

export default isSafeQueens;